//
//  main.swift
//  SwiftSyntaxLab
//
//  Created by Hanjuheon on 1/6/26.
//
//
import Foundation


print("\n# 필수문제 풀이 01\n")
Task01()
print("\n\n -----------------------------------------")

print("\n# 필수문제 풀이 02\n")
Task02()
print("\n\n -----------------------------------------")

print("\n# 필수문제 풀이 03\n")
Task03()
print("\n\n -----------------------------------------")

print("\n# 필수문제 풀이 04\n")
Task04()
print("\n\n -----------------------------------------")

print("\n# 필수문제 풀이 05\n")
Task05()
print("\n\n -----------------------------------------")



print("\n\n -----------------------------------------")
print("\n# 도전문제 풀이 01\n")
ChallengeTask01()

print("\n\n -----------------------------------------")
print("\n# 도전문제 풀이 01\n")
ChallengeTask02()

print("\n\n -----------------------------------------")
print("\n# 도전문제 풀이 01\n")
ChallengeTask03()

print("\n\n -----------------------------------------")
print("\n# 도전문제 풀이 01\n")
ChallengeTask04()
